In [8]:
import pandas as pd
dict={'Team':['CSK','RCB','MI,'],"Famous Players":['MSD','VK','GOD']}
df=pd.DataFrame(dict)
df

  Team Famous Players
0  CSK            MSD
1  RCB             VK
2  MI,            GOD

In [9]:
df.reset_index()

   index Team Famous Players
0      0  CSK            MSD
1      1  RCB             VK
2      2  MI,            GOD

In [5]:
df.index.name='Player'
df

       Team Famous Players
Player
0       CSK            MSD
1       RCB             VK
2       MI,            GOD

In [10]:
df.rename(columns={'Team':'IPL TEAM'},inplace=True)

In [11]:
df

       IPL TEAM Famous Players
Player
0           CSK            MSD
1           RCB             VK
2           MI,            GOD

In [15]:
df.at[0,'IPL TEAM']='''Chennai Super Kings'''
df

                   IPL TEAM Famous Players
Player
0       Chennai Super Kings            MSD
1                       RCB             VK
2                       MI,            GOD

In [19]:
df.reset_index()

   Player             IPL TEAM Famous Players
0       0  Chennai Super Kings            MSD
1       1                  RCB             VK
2       2                  MI,            GOD

In [20]:
df=df.reset_index().set_index('IPL TEAM')

In [21]:
df

                     Player Famous Players
IPL TEAM
Chennai Super Kings       0            MSD
RCB                       1             VK
MI,                       2            GOD

In [26]:
df['Famous Players'].nunique()

3

In [30]:
for i,j in df.iterrows():
    print(i,j)

Chennai Super Kings Player              0
Famous Players    MSD
Name: Chennai Super Kings, dtype: object
RCB Player             1
Famous Players    VK
Name: RCB, dtype: object
MI, Player              2
Famous Players    GOD
Name: MI,, dtype: object

In [33]:
df['Player']=df['Player'].astype('float')

In [34]:
df

                     Player Famous Players
IPL TEAM
Chennai Super Kings     0.0            MSD
RCB                     1.0             VK
MI,                     2.0            GOD

In [43]:
df.loc[['RCB','MI,'],['Player','Famous Players']]

          Player Famous Players
IPL TEAM
RCB          1.0             VK
MI,          2.0            GOD

In [46]:
df.index=df.index.astype('str')

In [47]:
df

                     Player Famous Players
IPL TEAM
Chennai Super Kings     0.0            MSD
RCB                     1.0             VK
MI,                     2.0            GOD

In [10]:
# Q .10. What's the most powerful pokemon from the first 3 generations, of type water?
#df.query('`Type 1` == "Water" & `Generation` in [1,2,3]').sort_values(['Total'],ascending=0).head(1).Name
#df.loc[df['Generation'.isin([1,2,3])]]

In [13]:
#Q .11. What's the most powerful Dragon from the last two generations?
#Find the most powerful pokemon (by Total) that is of type Dragon (either Type 1 or Type 2) and from the last two generations. Enter its name below. If there are multiple, enter the name of the Dragon with higher index value.
#df.reset_index().loc[(df['Type 1'] == 'Dragon')|(df['Type 2'] == 'Dragon')].sort_values(['Total','index'],ascending=[0,0]).head(1).Name

In [14]:
#This is the distribution of speed of the pokemons. The red lines indicate those bottom 5% and top 5% pokemons by speed:
# Try your code here
#slow_fast_df = df.loc[(df['Speed']<df['Speed'].quantile(.05)) | (df['Speed']>df['Speed'].quantile(.95))]